W6D3/routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def create
        artworkshare = ArtworkShare.new(artwork_share_params)
        # replace the `artwork_attributes_here` with the actual attribute keys
        if artworkshare.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 2], ["created_at", "2020-12-30 22:22:37.611966"], ["updated_at", "2020-12-30 22:22:37.611966"]]

    def destroy
        artworkshare = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]