W6D3/routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artwork_shares.viewer_id = NULL)
---
    def index
        # render json: Artwork.all

        artwork_own = Artwork.where(artist_id: params[:user_id])
        artwork_shared = Artwork.joins(:artwork_shares).where("artwork_shares.viewer_id = ?", params[:user_id])

INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Dogs"], ["img_url", "dogs.com"], ["artist_id", 1], ["created_at", "2020-12-30 22:17:58.762317"], ["updated_at", "2020-12-30 22:17:58.762317"]]
---
    def create
        artwork = Artwork.new(artwork_params)
        # replace the `artwork_attributes_here` with the actual attribute keys
        if artwork.save