W6D3/routes_and_controllers/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
---
    def index
        if params[:user_id]
            comments = Comment.where(user_id: params[:user_id])
        elsif params[:artwork_id]
            comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["artwork_id", 4], ["body", "I want mcdonalds"], ["created_at", "2020-12-30 23:11:25.042050"], ["updated_at", "2020-12-30 23:11:25.042050"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save