W6D3/routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE 'Potato')
SELECT "users".* FROM "users"
---
    def index
      if params[:query]
        render json: User.where('username LIKE ?', params[:query])
      else
        render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "potato"], ["email", "potato@gmail.com"], ["created_at", "2020-12-29 22:41:09.349704"], ["updated_at", "2020-12-29 22:41:09.349704"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "chippy@gmail.com"], ["updated_at", "2020-12-29 23:21:45.068825"], ["id", 3]]
---
    def update
      user = User.find(params[:id])

      if user.update(user_params)